Israr-Engineering/PMM-06XX-IO-GENERAL/custom_Board/1.8.13/variants/pmm0635XP/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.
  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.
  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_ARDUINO_ZERO_
#define _VARIANT_ARDUINO_ZERO_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK			  (48000000ul)

/*----------------------------------------------------------------------------
 *        Headers ahamd
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#ifdef __cplusplus
extern "C" unsigned int PINCOUNT_fn();
#endif
#define PINS_COUNT           (PINCOUNT_fn())
#define NUM_DIGITAL_PINS     (20u)
#define NUM_ANALOG_INPUTS    (9u)
#define NUM_ANALOG_OUTPUTS   (1u)
#define analogInputToDigitalPin(p)  ((p < 6u) ? (p) + 14u : -1)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

// LEDs (not defined for PMM0632X)
#define PIN_LED_13           (13u)
#define PIN_LED_RXL          (25u)
#define PIN_LED_TXL          (26u)
#define PIN_LED              PIN_LED_13
#define PIN_LED2             PIN_LED_RXL
#define PIN_LED3             PIN_LED_TXL
#define LED_BUILTIN          PIN_LED_13

/*
 * Digital pins for PMM0632X
 */
//01. Analog inputs on screw terminal 
#define PMM_AO_01          (8u) //PA10 : Analog Output 01
#define PMM_AO_02          (8u) //PA11 : Analog Output 02
#define PMM_AO_03          (3u) //PB09 : Analog Output 03
#define PMM_AO_04          (4u) //PA04 : Analog Output 04
#define PMM_AO_05          (6u) //PA08 : Analog Output 05
#define PMM_AO_06          (7u) //PA09 : Analog Output 06
#define PMM_AO_07          (53u) //PB07 : Analog Output 07
#define PMM_AO_08          (2u) //PB08 : Analog Output 08
#define PMM_AO_09          (10u) //PA06 : Analog Output 09
#define PMM_AO_10          (11U) //PA07 : Analog Output 10
#define PMM_AO_11          (51u) //PB05 : Analog Output 11
#define PMM_AO_12          (52U) //PB06 : Analog Output 12
#define PMM_AO_13          (67u) //PB31 : Analog Output 13
#define PMM_AO_14          (54u) //PB00 : Analog Output 14
#define PMM_AO_15          (46u) //PA03 : Analog Output 15
#define PMM_AO_16          (25u) //PA02 : Analog Output 16
#define PMM_AO_17          (32u) //PA28 : Analog Output 17
#define PMM_AO_18          (15u) //PB02 : Analog Output 18
#define PMM_AO_19          (16u) //PB03 : Analog Output 19
#define PMM_AO_20          (66u) //PB30 : Analog Output 20
#define PMM_AO_21          (31U) //PA27 : Analog Output 21
#define PMM_AO_22          (55u) //PB01 : Analog Output 22
#define PMM_AO_23          (5u) //PA05 : Analog Output 23
#define PMM_AO_24          (50u) //PB04 : Analog Output 24

//03b. Flash memory
#define PMM_DO_FLASH_CS    (59u) //PB13 : Digital output : Flash chip select command 
#define PMM_DO_FLASH_EN    (60u) //PB14 : Digital output : Flash chip select command 

//03d. options 
#define PMM_DI_INT    (18u)//PA14 : Digital Input : General interrupt from RTC or Extension boards  
#define PMM_RUN       (27u) //PA23
#define PMM_FAULT     (26u) //PB22
#define PMM_A0/1      (61u) //PB15
#define PMM_A1/1      (28u) //PA12
#define PMM_A2/1      (12u) //PA13










#define PMM_S0        (35u) //PB22
#define PMM_S1        (27u) //PA23
#define PMM_S2        (31u) //PA27
#define PMM_S3        (32u) //PA28

//03c. Serial RS485
#define PMM_DO_RDENA       (59u)//PB15 : Digital output : RS485 Direction control  

#define PMM_DI_PROG        (20u) //PA16 : Digital Input for programming mode - near termination dip switch


//03a. Ethernet controller
#define PMM_DO_ETH_RST     (8u) //PA06 : Digital output : Ethernet controller reset command
#define PMM_D1_ETH_INT     (9u) //PA07 : Digital Input : Ethernet controller interrupt 

#define PMM_DI_LossOfPower  (10u)//PA13 : Digital Input :loos of power 
#define PMM_DO_SCSn         (19u) //PA18 : Digital output : Ethernet controller chip select command  






#define PMM_READY          (0u) //PA05
#define PMM_DRDY           (1u) //PA06
#define PMM_SER            (3u) //PA08
#define PMM_RCLK           (4u) //PA09
#define PMM_SRCLK          (5u) //PA10
#define PMM_SRCLR#         (6u) //PA11
#define PMM_Error          (11u) //PB03
//02. Dip switches 
#define PMM_DI_PROG01      (29u) //PA27 : Digital Input - general (front panel dip switch )
#define PMM_DI_PROG02      (44u) //PA03 : Digital Input - general (front panel dip switch)
//03c. Serial RS485
#define PMM_DO_RDENA        (13u)//PA14 : Digital output : RS485 Direction control  

#define PMM_AI_WIZRST       (21u) //PA19 :
#define PMM_AI_INTN         (11u)//PA20 :
//03. Internal signals









 //* Analog pins (not defined for PMM0632X)
 
#define PIN_A0               (14ul)
#define PIN_A1               (15ul)
#define PIN_A2               (16ul)
#define PIN_A3               (17ul)
#define PIN_A4               (18ul)
#define PIN_A5               (19ul)
// Add For 0632X
#define PIN_A6               (4ul)
#define PIN_A7               (3ul)
#define PIN_A8               (1ul)
#define PIN_A9               (0ul)


#define PIN_DAC0             (14ul)



static const uint8_t A1  = PMM_AO_01;
static const uint8_t A2  = PMM_AO_02;
static const uint8_t A3  = PMM_AO_03;
static const uint8_t A4  = PMM_AO_04;
static const uint8_t A5  = PMM_AO_05;
static const uint8_t A6  = PMM_AO_06;
static const uint8_t A7  = PMM_AO_07;
static const uint8_t A8  = PMM_AO_08;
static const uint8_t A9  = PMM_AO_09;
static const uint8_t A10 = PMM_AO_10;
static const uint8_t A11 = PMM_AO_11;
static const uint8_t A12 = PMM_AO_12;
static const uint8_t A13 = PMM_AO_13;
static const uint8_t A14 = PMM_AO_14;
static const uint8_t A15 = PMM_AO_15;
static const uint8_t A16 = PMM_AO_16;
static const uint8_t A17 = PMM_AO_17;
static const uint8_t A18 = PMM_AO_18;
static const uint8_t A19 = PMM_AO_19;
static const uint8_t A20 = PMM_AO_20;
static const uint8_t A21 = PMM_AO_21;
static const uint8_t A22 = PMM_AO_22;
static const uint8_t A23 = PMM_AO_23;
static const uint8_t A24 = PMM_AO_24;





// static const uint8_t DO1= PMM_DI_01  ;
// static const uint8_t DO2= PMM_DI_02  ;
// static const uint8_t DO3= PMM_DI_03  ;
// static const uint8_t DO4= PMM_DI_04  ;
// static const uint8_t DO5= PMM_DI_05  ;
// static const uint8_t DO6= PMM_DI_06  ;
// static const uint8_t DO7= PMM_DI_07  ;
// static const uint8_t DO8= PMM_DI_08  ;


static const uint8_t DAC0 = PIN_DAC0;
#define ADC_RESOLUTION		12

// Other pins
#define PIN_ATN              (38ul)
static const uint8_t ATN = PIN_ATN;

/*
 * Serial interfaces
 */
// Serial (EDBG)
#define PIN_SERIAL_RX       (31ul)
#define PIN_SERIAL_TX       (30ul)
#define PAD_SERIAL_TX       (UART_TX_PAD_2)
#define PAD_SERIAL_RX       (SERCOM_RX_PAD_3)

// Serial1 (not defined for PMM0632X)

#define PIN_SERIAL1_RX       (0ul)
#define PIN_SERIAL1_TX       (1ul)
#define PAD_SERIAL1_TX       (UART_TX_PAD_2)
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_3)

/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1

#define PIN_SPI_MISO         (22u)
#define PIN_SPI_MOSI         (23u)
#define PIN_SPI_SCK          (24u)
#define PERIPH_SPI           sercom4
#define PAD_SPI_TX           SPI_PAD_2_SCK_3
#define PAD_SPI_RX           SERCOM_RX_PAD_0

//static const uint8_t SS	  = PIN_A2 ;	// SERCOM4 last PAD is present on A2 but HW SS isn't used. Set here only for reference.
static const uint8_t MOSI = PIN_SPI_MOSI ;
static const uint8_t MISO = PIN_SPI_MISO ;
static const uint8_t SCK  = PIN_SPI_SCK ;

/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA         (20u)
#define PIN_WIRE_SCL         (21u)
#define PERIPH_WIRE          sercom3
#define WIRE_IT_HANDLER      SERCOM3_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;

/*
 * USB
 */
#define PIN_USB_HOST_ENABLE (27ul)
#define PIN_USB_DM          (28ul)
#define PIN_USB_DP          (29ul)

/*
 * I2S Interfaces
 */
#define I2S_INTERFACES_COUNT 1

#define I2S_DEVICE          0
#define I2S_CLOCK_GENERATOR 3
#define PIN_I2S_SD          (9u)
#define PIN_I2S_SCK         (1u)
#define PIN_I2S_FS          (0u)

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;

extern Uart Serial;
extern Uart Serial1;
extern Uart Serial2;
extern Uart Serial3;

#endif

#ifdef __cplusplus
extern "C" {
#endif
unsigned int PINCOUNT_fn();
#ifdef __cplusplus
}
#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      SerialUSB
#define SERIAL_PORT_MONITOR         Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE_OPEN   Serial1

#endif /* _VARIANT_ARDUINO_ZERO_ */